# Список list=[15,48,'hello',6,19,'world’]
# Все числа этого списка проверить на чётность.
# Если число чётное, то посчитать сумму его цифр.
# Если нечётное, то заменить  его на 1 в списке.
# Все слова: посчитать количество гласных и согласных.
# Вывести всё на экран.

list = [15, 48, 'hello', 6, 19, "world"]
for i in enumerate(list):
    if i[1] is int:
        if i[1] % 2 == 0:
            sum1 = 0
            for j in str(1[1])
                sum1 += int(j)
                print(sum1)
            else:
                list[list].index(1)



